---
kind: property
id: P:Autodesk.Revit.UI.Events.ComboBoxCurrentChangedEventArgs.OldValue
source: html/1d6dfdac-087d-98bd-a8d5-eea033a12e8f.htm
---
# Autodesk.Revit.UI.Events.ComboBoxCurrentChangedEventArgs.OldValue Property

The current item for the ComboBox before the change.

## Syntax (C#)
```csharp
public ComboBoxMember OldValue { get; }
```